app/controllers/lists_stores_controller.rb

SELECT `lists_stores`.* FROM `lists_stores` WHERE `lists_stores`.`store_id` = 4 AND `lists_stores`.`list_id` = 16
DELETE FROM `lists_stores` WHERE `lists_stores`.`id` = 47
---
    def destroy
      lists_store = ListsStore.find(:all,
                                    :conditions => { :store_id => params[:store_id],
                                                     :list_id => params[:list_id]
                                                    })

      lists_store.each { |store| store.delete}