app/controllers/lists_controller.rb

	def create
    	@list = List.new(params[:list])

      respond_to do |format|
     	if @list.save
          @list_user = @list.lists_users.create(:user_id => session[:user_id])
---
INSERT INTO `lists` (`created_at`, `name`, `privacy`, `updated_at`) VALUES ('2012-05-09 00:48:01', 'Test', NULL, '2012-05-09 00:48:01')
INSERT INTO `lists_users` (`created_at`, `list_id`, `owner`, `updated_at`, `user_id`) VALUES ('2012-05-09 00:48:01', 47, NULL, '2012-05-09 00:48:01', 17)

    def add
        @list = List.find(params[:list_id])

        respond_to do |format|
          @lists_store = @list.lists_stores.create(:store_id => params[:store_id])
---
SELECT `lists`.* FROM `lists` WHERE `lists`.`id` = 47 LIMIT 1
INSERT INTO `lists_stores` (`created_at`, `list_id`, `store_id`, `updated_at`) VALUES ('2012-05-09 00:48:06', 47, 3, '2012-05-09 00:48:06')

    def destroy
    @list = List.find(params[:id])
    @list.destroy
    default_list_id = ListsUser.find_default_list(session[:user_id])
---
SELECT `lists`.* FROM `lists` WHERE `lists`.`id` = 50 LIMIT 1
DELETE FROM `lists` WHERE `lists`.`id` = 50
SELECT `lists_users`.* FROM `lists_users` WHERE `lists_users`.`user_id` = 6 LIMIT 1