app/controllers/sessions_controller.rb

	def create
		user = User.find_by_email(params[:session][:email])
		default_list_id = ListsUser.find_default_list(user.id)
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'jctanti@gmail.com' LIMIT 1
SELECT `lists_users`.* FROM `lists_users` WHERE `lists_users`.`user_id` = 6 LIMIT 1
SELECT `lists`.* FROM `lists` WHERE `lists`.`user_id` = 6 LIMIT 1