app/controllers/stores_controller.rb

INSERT INTO `stores` (`been_to`, `can_delete`, `created_at`, `detail_info`, `favorite`, `image`, `name`, `updated_at`) VALUES (0, NULL, '2012-05-09 01:40:02', 'ChocolateEEEEEE!!!', 0, NULL, 'Willy Wonka\'s', '2012-05-09 01:40:02')
---
  def create
  	@store = Store.new(params[:store])

  	respond_to do |format|
  		if @store.save