app/controllers/users_controller.rb

INSERT INTO `users` (`created_at`, `email`, `fb_id`, `first_name`, `last_name`, `password`, `picture_link`, `updated_at`) VALUES ('2012-05-09 00:45:48', 'sergei@gmail.com', NULL, 'Sergei', 'Rachmaninov', 'test', NULL, '2012-05-09 00:45:48')
---
  def create
    @user = User.new(params[:user])
    puts @user.first_name()
    puts @user.email()
    puts @user.password()
    puts "true" if @user.valid?

    respond_to do |format|
      if @user.save

SELECT `users`.* FROM `users` WHERE `users`.`id` = 6 LIMIT 1
SELECT name, id FROM `lists` WHERE (id IN (12,15,16,18,24,25,26,27,28,29,30,37,43))
SELECT name, id FROM `stores` WHERE (id IN (2,3))
SELECT store_id FROM `lists_stores` WHERE `lists_stores`.`list_id` = 13
---
  def show
    @user = User.find(params[:id])
    @lists = List.find_users_lists(params[:id])

    if params[:cur_list]
      @stores = Store.find_lists_stores(params[:cur_list])