app/controllers/users_controller.rb

SELECT `stores`.* FROM `stores`
---
  def show
    # XXX need to verify user_id is valid
    # XXX raise exception and catch, then display error page.

    # XXX This is only temporary until the team finds a solution on sharing
    @current_user_id = session[:user_id]
   # if (defined? current_user_id)
    #  if (current_user_id != params[:id])
     #   params[:id] = current_user_id
     # end
    #end

    user_entity = UserEntity.new
    user_entity.find_by_id(params[:id])
    @user = user_entity.user
    lists = user_entity.users_store_lists

    if params[:cur_list]
      list_entity = ListEntity.new(params[:cur_list])
      @current_list = list_entity.current_list
      @stores = list_entity.associated_stores
    else
      if lists != nil and lists.size > 0